import about1 from "../assets/about1.jpeg";
import about2 from "../assets/about2.jpeg";
import about3 from "../assets/about3.jpeg";
import about4 from "../assets/about4.jpeg";
import about5 from "../assets/about5.jpeg";

export default function Aboutus() {
  return (
    <div>
      <section className=" p-8  ">
        <div className="container mx-auto flex max-md:flex-col max-md:gap-7 justify-center items-center bg-white rounded-3xl p-5">
          {/* Left Image */}
          <div className="w-1/2 max-md:w-full">
            <img
              src={about1}
              alt="Community Management Tool"
              className="w-[450px] h-[450px] object-cover rounded-2xl overflow-hidden"
            />
          </div>

          {/* Right Text Content */}
          <div className="w-1/2 max-md:w-full text-right ">
            <p className="text-gray-700 text-lg">
              نحن نتميز عن غيرنا بواجهة سهلة التعامل لكلٍ من الطالب والمعلم، مما
              يجعل العملية التعليمية أكثر سلاسة وفعالية. 🚀🔥
              <br />
              فضل تصميمنا البسيط والبديهي، يمكن للطلاب الوصول إلى الموارد
              التعليمية بسهولة وإتمام مهامهم بسرعة، بينما يمكن للمعلمين إدارة
              الفصول وتصحيح الواجبات بشكل فعال دون تعقيدات تكنولوجية. 🤩💯
              <br />
              كذلك، نحرص على توفير أدوات تفاعلية تساعد في جعل التعلم تجربة ممتعة
              ومحفزة، مما يعزز من تفاعل الطلاب ويزيد من تحصيلهم العلمي.
              🎯باختصار، نحن نقدم بيئة تعليمية متكاملة تدعم الجميع وتسهم في
              تحقيق النجاح الأكاديمي.📚🚀
            </p>
          </div>
        </div>
      </section>
      <section className=" p-8  ">
        <div className="container mx-auto flex max-md:flex-col max-md:gap-7 justify-center items-center bg-white rounded-3xl p-5">
          <div className="w-1/2 max-md:w-full text-right max-md:order-2">
            <p className="text-gray-700 text-lg">
              نحن نتميّز عن غيرنا لعدة أسباب تجعلنا الخيار الأمثل للعملاء.
              أولاً، نقدم أسعاراً منافسة تفوق تلك التي تقدمها باقي المنصات، مما
              يضمن حصولكم على أفضل قيمة مقابل المال المدفوع. 🔥🤩💸
              <br />
              ثانياً، نحرص على توفير طرق دفع سهلة وسلسة، مما يتيح للعملاء إتمام
              عملياتهم بسرعة وبدون تعقيدات. 🌟
              <br />
              نسعى دائماً إلى تقديم تجربة مريحة ومميزة، تجمع بين الجودة العالية
              والأسعار المناسبة والتسهيلات في الدفع، مما يجعلنا الوجهة الأولى
              لكل من يبحث عن خدمة موثوقة وفعّالة.💯👀
            </p>
          </div>

          <div className="w-1/2 max-md:w-full ">
            <img
              src={about2}
              alt="Community Management Tool"
              className="w-[450px] h-[450px] object-cover rounded-2xl overflow-hidden mr-auto"
            />
          </div>
        </div>
      </section>
      <section className=" p-8  ">
        <div className="container mx-auto flex max-md:flex-col max-md:gap-7 justify-center items-center bg-white rounded-3xl p-5">
          {/* Left Image */}
          <div className="w-1/2 max-md:w-full">
            <img
              src={about3}
              alt="Community Management Tool"
              className="w-[450px] h-[450px] object-cover rounded-2xl overflow-hidden"
            />
          </div>

          {/* Right Text Content */}
          <div className="w-1/2 max-md:w-full text-right ">
            <p className="text-gray-700 text-lg">
              نتميز عن غيرنا بعدة جوانب تجعلنا الخيار الأفضل للمعلمين والطلاب
              على حد سواء. 💯🔥
              <br />
              أولاً، نقدم لوحة تحكم بسيطة وسهلة الاستخدام تمكن المعلمين من إدارة
              محتوياتهم التعليمية بكفاءة وسلاسة. يمكن للمعلمين رفع الفيديوهات
              والمذكرات بسهولة، مما يوفر عليهم الوقت والجهد في تقديم المواد
              التعليمية. 🌟🥇
              <br />
              بالإضافة إلى ذلك، نقدم إمكانية إنشاء امتحانات دورية تساهم في تقييم
              تقدم الطلاب وتحسين مستواهم التعليمي بشكل مستمر. 🎯
              <br />
              هذه الخصائص تجعل منصتنا مكانًا مثاليًا للتعليم الحديث، حيث نسعى
              إلى دمج التكنولوجيا في العملية التعليمية بطريقة تسهل على الجميع
              الوصول إلى أفضل النتائج.🚀
            </p>
          </div>
        </div>
      </section>
      <section className=" p-8  ">
        <div className="container mx-auto flex max-md:flex-col max-md:gap-7 justify-center items-center bg-white rounded-3xl p-5">
          <div className="w-1/2 max-md:w-full text-right max-md:order-2">
            <p className="text-gray-700 text-lg">
              نحن نتميّز عن غيرنا لأننا نقدم بث المؤتمرات الطبية والعالمية بجودة
              عالية، وهي ميّزة لا تجدها إلا عندنا. 🚀🗣
              <br />
              نحرص على توفير تجربة بصرية وصوتية لا مثيل لها، مما يضمن أن جميع
              المعلومات والمناقشات تصل إلى جمهورنا بوضوح تام. 🔥🤩
              <br />
              فريقنا المتميز والمتخصص يضمن أن يتم البث بسلاسة ودون انقطاع، مما
              يتيح لك الاستفادة الكاملة من كل لحظة في الحدث. نحن نفهم أهمية هذه
              المؤتمرات ونسعى دائماً لتقديم أفضل خدمة لعملائنا، مما يجعلنا
              الخيار الأمثل لبث الأحداث الهامة.🎯🥇
            </p>
          </div>

          <div className="w-1/2 max-md:w-full ">
            <img
              src={about4}
              alt="Community Management Tool"
              className="w-[450px] h-[450px] object-cover rounded-2xl overflow-hidden mr-auto"
            />
          </div>
        </div>
      </section>
      <section className=" p-8  ">
        <div className="container mx-auto flex max-md:flex-col max-md:gap-7 justify-center items-center bg-white rounded-3xl p-5">
          {/* Left Image */}
          <div className="w-1/2 max-md:w-full">
            <img
              src={about5}
              alt="Community Management Tool"
              className="w-[450px] h-[450px] object-cover rounded-2xl overflow-hidden"
            />
          </div>

          {/* Right Text Content */}
          <div className="w-1/2 max-md:w-full text-right ">
            <p className="text-gray-700 text-lg">
              بالتأكيد، يمكننا التحدث عن المزايا التي تجعلنا متميزين عن غيرنا.
              🤩
              <br />
              نحن نقدم نظام مذكرات وامتحانات فريد من نوعه، حيث يمكن للطلاب شراء
              مواد دراسية شاملة تغطي جميع الفصول الدراسية. 👀💡
              <br />
              نظام الامتحانات لدينا مصمم ليكون عالي الجودة وسهل التعامل، مما
              يضمن تجربة تعليمية سلسة وفعالة. 🔥
              <br />
              نحن نحرص على توفير بيئة تعليمية داعمة ومحفزة، تُمكّن الطلاب من
              تحقيق أفضل النتائج الأكاديمية. بفضل هذا النظام المتكامل، يمكن
              للطلاب الاستعداد للامتحانات بثقة والاستفادة من الموارد المتاحة
              لتحسين أدائهم الدراسي.🎯💯
            </p>
          </div>
        </div>
      </section>
    </div>
  );
}
